#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stratocloud/aws-eks-env/runs/run-KncW9wH7psYBYVGU

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ebs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ebs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Enable IAM User Permissions"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::662356985459:user/Terraform_Provisioning_SA",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Allow service-linked role use of the CMK"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::662356985459:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Allow attachment of persistent resources"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "true",
                ]
              + variable = "kms:GrantIsForAWSResource"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::662356985459:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_eks_addon.aws_ebs_csi_driver will be created
  + resource "aws_eks_addon" "aws_ebs_csi_driver" {
      + addon_name        = "aws-ebs-csi-driver"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name        = "coredns"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name        = "kube-proxy"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # aws_iam_policy.node_additional will be created
  + resource "aws_iam_policy" "node_additional" {
      + arn         = (known after apply)
      + description = "Example usage of node additional policy"
      + id          = (known after apply)
      + name        = "stratocloud-eks-npd-additional"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all    = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
    }

  # aws_iam_role_policy_attachment.additional["nodegroup-1a"] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.additional["nodegroup-1b"] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # aws_key_pair.this will be created
  + resource "aws_key_pair" "this" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "stratocloud-eks-npd"
      + key_pair_id     = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all        = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
    }

  # aws_kms_key.ebs will be created
  + resource "aws_kms_key" "ebs" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Customer managed key to encrypt EKS managed node group volumes"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "EKS Secret Encryption Key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all                           = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
    }

  # aws_security_group.additional will be created
  + resource "aws_security_group" "additional" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                  + "172.16.0.0/12",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "stratocloud-eks-npd-additional"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.remote_access will be created
  + resource "aws_security_group" "remote_access" {
      + arn                    = (known after apply)
      + description            = "Allow remote SSH access"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "stratocloud-eks-npd-remote-access"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                 = (known after apply)
    }

  # tls_private_key.this will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this"  {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/stratocloud-eks-npd/cluster"
      + retention_in_days = 90
      + tags              = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all          = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["CostCenter"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "CostCenter"
      + resource_id = (known after apply)
      + value       = "001"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Customer"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Customer"
      + resource_id = (known after apply)
      + value       = "demo"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Department"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Department"
      + resource_id = (known after apply)
      + value       = "IT"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Owner"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Owner"
      + resource_id = (known after apply)
      + value       = "demo"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Purpose"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Purpose"
      + resource_id = (known after apply)
      + value       = "Business"
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "stratocloud-eks-npd"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud-eks-npd"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all                  = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud-eks-npd"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + version                   = "1.22"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud-eks-npd-eks-irsa"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all        = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud-eks-npd-eks-irsa"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "stratocloud-eks-npd-cluster-ClusterEncryption"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all    = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "stratocloud-eks-npd-cluster-"
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all              = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "stratocloud-eks-npd-cluster"
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "stratocloud-eks-npd-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud-eks-npd-cluster"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud-eks-npd-cluster"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "stratocloud-eks-npd-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud-eks-npd-node"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "owned"
        }
      + tags_all               = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud-eks-npd-node"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "To node 1025-65535"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Node all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/UDP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node all ports/protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks_vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.eks_vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks_vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-us-east-1a"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all             = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-us-east-1a"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc                  = true
    }

  # module.eks_vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id   = (known after apply)
    }

  # module.eks_vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-us-east-1a"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all             = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-us-east-1a"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
    }

  # module.eks_vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.eks_vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.eks_vpc.aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-intra"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all         = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-intra"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id           = (known after apply)
    }

  # module.eks_vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-private"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all         = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-private"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id           = (known after apply)
    }

  # module.eks_vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-public"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all         = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-public"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id           = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.intra[2] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.eks_vpc.aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-intra-us-east-1a"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all                                       = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-intra-us-east-1a"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-intra-us-east-1b"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all                                       = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-intra-us-east-1b"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_subnet.intra[2] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-intra-us-east-1c"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all                                       = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc-intra-us-east-1c"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-private-us-east-1a"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                                       = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-private-us-east-1a"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-private-us-east-1b"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                                       = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-private-us-east-1b"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-private-us-east-1c"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + tags_all                                       = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-private-us-east-1c"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/internal-elb"           = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-public-us-east-1a"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                                       = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-public-us-east-1a"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-public-us-east-1b"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                                       = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-public-us-east-1b"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-public-us-east-1c"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + tags_all                                       = {
          + "CostCenter"                                = "001"
          + "Customer"                                  = "demo"
          + "Department"                                = "IT"
          + "Name"                                      = "stratocloud_vpc-public-us-east-1c"
          + "Owner"                                     = "demo"
          + "Purpose"                                   = "Business"
          + "kubernetes.io/cluster/stratocloud-eks-npd" = "shared"
          + "kubernetes.io/role/elb"                    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.eks_vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all                             = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "stratocloud_vpc"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
    }

  # module.eks_vpc_cni_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks_vpc_cni_irsa.aws_iam_policy.vpc_cni[0] will be created
  + resource "aws_iam_policy" "vpc_cni" {
      + arn         = (known after apply)
      + description = "Provides the Amazon VPC CNI Plugin (amazon-vpc-cni-k8s) the permissions it requires to modify the IPv4/IPv6 address configuration on your EKS worker nodes"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_CNI_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:AssignIpv6Addresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "IPV6"
                    },
                  + {
                      + Action   = "ec2:CreateTags"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:*:network-interface/*"
                      + Sid      = "CreateTags"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all    = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
    }

  # module.eks_vpc_cni_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "VPC-CNI-IRSA"
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all              = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_vpc_cni_irsa.aws_iam_role_policy_attachment.vpc_cni[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_cni" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1a"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "stratocloud-eks-npd"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m6i.large",
          + "t3a.large",
          + "t3a.xlarge",
        ]
      + labels                 = {
          + "env"      = "dev"
          + "platform" = "apps"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "nodegroup-1a-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "nodegroup-1a"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "nodegroup-1a"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + taint {
          + effect = "NO_SCHEDULE"
          + key    = "platform"
          + value  = "apps"
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1a"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "eks-managed-node-group-demo-"
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all              = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1a"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1a"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1a"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1a"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for nodegroup-1a EKS managed node group"
      + id                     = (known after apply)
      + image_id               = "ami-0f80e6144aa24f34d"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nodegroup-1a-"
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "CostCenter" = "001"
              + "Customer"   = "demo"
              + "Department" = "IT"
              + "Name"       = "nodegroup-1a"
              + "Owner"      = "demo"
              + "Purpose"    = "Business"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "CostCenter" = "001"
              + "Customer"   = "demo"
              + "Department" = "IT"
              + "Name"       = "nodegroup-1a"
              + "Owner"      = "demo"
              + "Purpose"    = "Business"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "CostCenter" = "001"
              + "Customer"   = "demo"
              + "Department" = "IT"
              + "Name"       = "nodegroup-1a"
              + "Owner"      = "demo"
              + "Purpose"    = "Business"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1a"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "EKS managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nodegroup-1a-eks-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "nodegroup-1a-eks-node-group"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "nodegroup-1a-eks-node-group"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1b"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "stratocloud-eks-npd"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m6i.large",
          + "t3a.large",
          + "t3a.xlarge",
        ]
      + labels                 = {
          + "env"      = "dev"
          + "platform" = "apps"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "nodegroup-1b-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "nodegroup-1b"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "nodegroup-1b"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + taint {
          + effect = "NO_SCHEDULE"
          + key    = "platform"
          + value  = "apps"
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1b"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "eks-managed-node-group-demo-"
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all              = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1b"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1b"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1b"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1b"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for nodegroup-1b EKS managed node group"
      + id                     = (known after apply)
      + image_id               = "ami-0f80e6144aa24f34d"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nodegroup-1b-"
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "CostCenter" = "001"
              + "Customer"   = "demo"
              + "Department" = "IT"
              + "Name"       = "nodegroup-1b"
              + "Owner"      = "demo"
              + "Purpose"    = "Business"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "CostCenter" = "001"
              + "Customer"   = "demo"
              + "Department" = "IT"
              + "Name"       = "nodegroup-1b"
              + "Owner"      = "demo"
              + "Purpose"    = "Business"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "CostCenter" = "001"
              + "Customer"   = "demo"
              + "Department" = "IT"
              + "Name"       = "nodegroup-1b"
              + "Owner"      = "demo"
              + "Purpose"    = "Business"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["nodegroup-1b"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "EKS managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "nodegroup-1b-eks-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "nodegroup-1b-eks-node-group"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + tags_all               = {
          + "CostCenter" = "001"
          + "Customer"   = "demo"
          + "Department" = "IT"
          + "Name"       = "nodegroup-1b-eks-node-group"
          + "Owner"      = "demo"
          + "Purpose"    = "Business"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 89 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                             = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
    ]
  + cluster_addons                                  = {}
  + cluster_arn                                     = (known after apply)
  + cluster_certificate_authority_data              = (known after apply)
  + cluster_endpoint                                = (known after apply)
  + cluster_id                                      = (known after apply)
  + cluster_oidc_issuer_url                         = (known after apply)
  + cluster_platform_version                        = (known after apply)
  + cluster_status                                  = (known after apply)
  + cluster_version                                 = "1.22"
  + default_security_group_id                       = (known after apply)
  + eks_managed_node_groups                         = {
      + nodegroup-1a = {
          + iam_role_arn                       = (known after apply)
          + iam_role_name                      = (known after apply)
          + iam_role_unique_id                 = (known after apply)
          + launch_template_arn                = (known after apply)
          + launch_template_id                 = (known after apply)
          + launch_template_latest_version     = (known after apply)
          + node_group_arn                     = (known after apply)
          + node_group_autoscaling_group_names = (known after apply)
          + node_group_id                      = (known after apply)
          + node_group_resources               = (known after apply)
          + node_group_status                  = (known after apply)
          + security_group_arn                 = (known after apply)
          + security_group_id                  = (known after apply)
        }
      + nodegroup-1b = {
          + iam_role_arn                       = (known after apply)
          + iam_role_name                      = (known after apply)
          + iam_role_unique_id                 = (known after apply)
          + launch_template_arn                = (known after apply)
          + launch_template_id                 = (known after apply)
          + launch_template_latest_version     = (known after apply)
          + node_group_arn                     = (known after apply)
          + node_group_autoscaling_group_names = (known after apply)
          + node_group_id                      = (known after apply)
          + node_group_resources               = (known after apply)
          + node_group_status                  = (known after apply)
          + security_group_arn                 = (known after apply)
          + security_group_id                  = (known after apply)
        }
    }
  + eks_managed_node_groups_autoscaling_group_names = (known after apply)
  + igw_id                                          = (known after apply)
  + intra_route_table_ids                           = [
      + (known after apply),
    ]
  + intra_subnet_arns                               = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + intra_subnets                                   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + intra_subnets_cidr_blocks                       = [
      + "192.168.20.0/24",
      + "192.168.21.0/24",
      + "192.168.22.0/24",
    ]
  + nat_ids                                         = [
      + (known after apply),
    ]
  + natgw_ids                                       = [
      + (known after apply),
    ]
  + private_route_table_ids                         = [
      + (known after apply),
    ]
  + private_subnet_arns                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets                                 = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                     = [
      + "192.168.0.0/24",
      + "192.168.1.0/24",
      + "192.168.2.0/24",
    ]
  + public_subnet_arns                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                                  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                      = [
      + "192.168.10.0/24",
      + "192.168.11.0/24",
      + "192.168.12.0/24",
    ]
  + vpc_cidr_block                                  = "192.168.0.0/16"
  + vpc_id                                          = (known after apply)
  + vpc_main_route_table_id                         = (known after apply)
  + vpc_name                                        = "stratocloud_vpc"

```
</details>
*Pusher: @stratocloud, Action: `pull_request`*